---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomDesignPowerLoadParam
source: html/7352c1bf-f5a8-0745-3d8f-189d16186264.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomDesignPowerLoadParam Property

"Specified Power Load"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomDesignPowerLoadParam { get; }
```